In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
csv_file = "Final_CSVs/temp_full.csv"
temp_full_df = pd.read_csv(csv_file)
temp_full_df.head()

       Country    Month  Year  Change in Temp (C)
0  Afghanistan  January  1961               0.993
1  Afghanistan  January  1962               0.137
2  Afghanistan  January  1963               2.441
3  Afghanistan  January  1964              -5.359
4  Afghanistan  January  1965               2.211

In [3]:
csv_file = "Final_CSVs/temp_simple.csv"
temp_simple_df = pd.read_csv(csv_file)
temp_simple_df.head()

       Country    Month  Year  Change in Temp (C)
0  Afghanistan  January  1961               0.993
1  Afghanistan  January  1962               0.137
2  Afghanistan  January  1963               2.441
3  Afghanistan  January  1964              -5.359
4  Afghanistan  January  1965               2.211

In [4]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/Climate_Temp')
conn = engine.connect()

In [5]:
engine.table_names()

<ipython-input-5-d72bc75a6b62>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['temp_simple', 'temp_full']

In [6]:
temp_full_df.to_sql(name= 'temp_full', con=engine, if_exists='append', index=False)
temp_simple_df.to_sql(name='temp_simple', con=engine, if_exists='append', index=False)

In [7]:
pd.read_sql_query('select * from temp_full', con=engine).head()

       Country    Month  Year  Change in Temp (C)
0  Afghanistan  January  1961               0.993
1  Afghanistan  January  1962               0.137
2  Afghanistan  January  1963               2.441
3  Afghanistan  January  1964              -5.359
4  Afghanistan  January  1965               2.211

In [8]:
pd.read_sql_query('select * from temp_simple', con=engine).head()

       Country    Month  Year  Change in Temp (C)
0  Afghanistan  January  1961               0.993
1  Afghanistan  January  1962               0.137
2  Afghanistan  January  1963               2.441
3  Afghanistan  January  1964              -5.359
4  Afghanistan  January  1965               2.211